Repository: TMaddox/PictureSync
Catalog: PictureSync/Properties/Resources.*.resx
Languages: de

# Program_Main_Exit
source: Exit
de: Verlassen

# Program_Main_Hide
source: Hide
de: Verstecken

# Program_Main_Bot_started_log
source: Bot started
de: Bot gestartet

# Program_Main_Show
source: Show
de: Anzeigen

# Program_Main_Bot_stopped_log
source: Bot stopped
de: Bot gestoppt

# TelegramBot_picture_accepted
source: Picture accepted.
de: Bild akzeptiert.

# TelegramBot_picture_accepted_uncompressed
source: Accepted uncompressed picture.
de: Unkomprimiertes Bild akzeptiert von.

# TelegramBot_picture_accepted_log
source: picture accepted from
de: Bild akzeptiert von

# TelegramBot_picture_compression_autoenable_log
source: autoenable compression for
de: autoenable compression für

# TelegramBot_picture_compression_autoenable
source: Image compressing is active again.
de: Komprimierung ist wieder aktiv.

# TelegramBot_picture_wrong_filetype
source: Error. Wrong file type.
de: Error. Falscher Dateityp.

# TelegramBot_picture_wrong_filetype_log
source: Error, wrong file type from
de: Error. Falscher Dateityp.

# TelegramBot_picture_saved_as_log
source: as
de: als

# TelegramBot_Bot_OnMessage_deny_picture
source: Picture not accepted. Please send as file.
de: Bild nicht akzeptiert. Bitte als Datei senden.

# TelegramBot_Bot_OnMessage_deny_picture_log
source: tried to send a picture, but sent not as file.
de: versuchte ein Bild zu senden, allerdings nicht als Datei

# TelegramBot_Bot_OnMessage_document_incoming_log
source: Document incoming from
de: Dokument wird geladen von

# TelegramBot_Bot_OnMessage_auth_successful_log
source: has just authenticated a new telegram account
de: hat gerade einen neuen Telegram Account authentifiziert

# TelegramBot_Bot_OnMessage_auth_successful
source: Authentification successful.
de: Authentifizierung erfolgreich.

# TelegramBot_Bot_OnMessage_auth_not_successful_log
source: tried to authenticate, but entered wrong password.
de: versuchte sich zu authentifizieren, gab aber das falsche Passwort ein

# TelegramBot_Bot_OnMessage_auth_not_successful
source: Authentication error.
de: Authentifizierungs Fehler.

# TelegramBot_Bot_OnMessage_auth_no_username
source: Authentication error. Have you set a username?
de: Authentifizierungs Fehler. Ist ein Benutzername gesetzt?

# TelegramBot_Date_taken_no_capturetime
source: Photo has no capture time (using servertime instead) from
de: Foto hat kein Aufnahmedatum (speichere mit Serverzeit) von

# TelegramBot_AdminCommands_activity_accessed
source: accessed activity
de: sah in die Aktivität ein

# TelegramBot_AdminCommands_party
source: You enabled the partymode. YAY!
de: Du hast den Partymodus aktiviert. Gratuliere!

# TelegramBot_CommonCommands_commands
source: Commands:
de: Befehle:

# TelegramBot_CommonCommands_help_activity_amount
source: /activity_amount - Displays amount of pictures sent per user
de: /amountactivity - Zeigt an wieviele Bilder pro Nutzer insgesamt schon gesendet wurden

# TelegramBot_CommonCommands_help_activity_time
source: /activity_time - Displays date when users were last time active
de: /timeactivity - Zeigt die letzte Nutzeraktivität an

# TelegramBot_CommonCommands_help_coff
source: /coff - Disable comression for one picture
de: /coff - Komprimierung für das nächste Bild deaktivieren

# TelegramBot_CommonCommands_help_con
source: /con - enable compression
de: /con - Komprimierung aktivieren

# TelegramBot_CommonCommands_help_admin
source: /admin <pw> - Authenticate as admin
de: /admin <pw> - Als admin registrieren

# TelegramBot_CommonCommands_help_auth
source: /auth <pw> - Authenticates a new user
de: /auth <pw> - Einen neuen Nutzer authentifizieren

# TelegramBot_CommonCommands_help_help
source: /help - Displays this text
de: /help - Zeigt diesen Text an

# TelegramBot_CommonCommands_admin_successful_log
source: has just authenticated as Admin
de: hat sich als Admin registriert

# TelegramBot_CommonCommands_admin_successful
source: You are now a Admin.
de: Sie sind jetzt Admin

# TelegramBot_CommonCommands_admin_not_successful_log
source: tried to get admin, but entered wrong password
de: versuchte sich als admin zu registrieren, gab aber das falsche Passwort ein

# TelegramBot_CommonCommands_admin_not_successful
source: Failed. You have no Admin rights.
de: Fehler. Sie haben keine Admin Rechte.

# TelegramBot_CommonCommands_coff_log
source: disabled compression
de: deaktivierte die Komprimierung

# TelegramBot_CommonCommands_coff
source: Compression is disabled for the next picture.
de: Komprimierung ist für das nächste Bild deaktiviert.

# TelegramBot_CommonCommands_con_log
source: enabled compression
de: aktivierte die Komprimierung

# TelegramBot_CommonCommands_con
source: Compression is enabled.
de: Komprimierung ist aktiviert.

# TelegramBot_CommonCommands_Note_log
source: Note:
de: Notiz:

# TelegramBot_CommonCommands_nocommand
source: Can´t parse command.
de: Befehl nicht vorhanden.

# TelegramBot_CommonCommands_help_change_pw
source: /pwedit <old> <new> - Changes the password
de: /pwedit <alt> <neu> - Ändert das Passwort

# TelegramBot_CommonCommands_help_clear_activity
source: /clear_activity - Clears all stored activities
de: /timeactivity_clear - Setzt Nutzeraktivität zurück

# TelegramBot_CommonCommands_help_clear_amount
source: /clear_amount - Clears amount counters
de: /amountactivity_clear - Setzt alle Zähler zurück

# TelegramBot_CommonCommands_help_log
source: /log - Returns the last 100 lines of the log
de: /log - Zeigt die letzten 100 Zeilen des Logs an

# TelegramBot_CommonCommands_help_add_user
source: /add_user <user> - Adds a new user
de: /add_user <user> - Fügt einen neuen Nutzer hinzu

# TelegramBot_AdminCommands_add_user_success
source: successfully added
de: Erfolgreich hinzugefügt

# TelegramBot_AdminCommands_add_user_success_log
source: succesfully added
de: hat hinzugefügt:

# TelegramBot_AdminCommands_log_accessed
source: accessed log
de: hat sich den Log angesehen

source: Error
de: Fehler

source: Success
de: Erfolgreich
